sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
#include "stm32f1xx_hal.h"

#include "remotebsp_embedded/board_config.h"
#include "remotebsp_embedded/byte_ring.h"
#include "remotebsp_embedded/core.h"
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
#include "remotebsp_embedded/soft_half_duplex_uart.h"
#endif
#include "remotebsp_embedded/startup_gpio.h"
#ifdef CONFIG_USB_DEBUG_CDC
#include "remotebsp_embedded/usb_debug.h"
#endif

#include <string.h>

#if CONFIG_SYSTEM_CLOCK_HZ != 72000000
#error "STM32F103CBT6 当前时钟方案固定为 72MHz"
#endif

#if HSE_VALUE != 8000000U
#error "STM32F103CBT6 当前时钟方案要求 8MHz 外部晶振"
#endif

#if (36000000U % (CONFIG_CAN_NOMINAL_BITRATE * 18U)) != 0
#error "当前 F103 CAN 位时序无法精确生成所选仲裁段波特率"
#endif

#define CAN_PRESCALER \
    (36000000U / (CONFIG_CAN_NOMINAL_BITRATE * 18U))

#if CAN_PRESCALER < 1 || CAN_PRESCALER > 1024
#error "F103 CAN 分频系数超出硬件范围"
#endif

#if CONFIG_UART_RESOURCE_COUNT > 0 && \
    !defined(CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART)
#define RBSP_HARDWARE_UART_ENABLED 1
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
#if !defined(CONFIG_UART0_PINS_PA9_PA10) && \
    !defined(CONFIG_UART0_PINS_PB6_PB7)
#error "启用 F103 UART 时必须选择 USART1 引脚组"
#endif
#if CONFIG_UART_RX_BUFFER_SIZE < 2 || CONFIG_UART_TX_BUFFER_SIZE < 2
#error "UART 环形缓冲至少需要两个字节"
#endif
#endif

static CAN_HandleTypeDef can_handle;
static rbsp_core_t remote_core;

#ifdef CONFIG_REMOTEBSP_MOTION
#if (1000000U % CONFIG_MOTION_TIMER_HZ) != 0U
#error "F103 运动定时器频率必须整除 1MHz 调度时基"
#endif

#ifdef CONFIG_MOTION_SLOT0_ENABLED
#define MOTION_SLOT0_AXIS_COUNT 1U
#else
#define MOTION_SLOT0_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
#define MOTION_SLOT1_AXIS_COUNT 1U
#else
#define MOTION_SLOT1_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
#define MOTION_SLOT2_AXIS_COUNT 1U
#else
#define MOTION_SLOT2_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
#define MOTION_SLOT3_AXIS_COUNT 1U
#else
#define MOTION_SLOT3_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
#define MOTION_SLOT4_AXIS_COUNT 1U
#else
#define MOTION_SLOT4_AXIS_COUNT 0U
#endif

#define MOTION_SLOT_AXIS_COUNT \
    (MOTION_SLOT0_AXIS_COUNT + MOTION_SLOT1_AXIS_COUNT + \
     MOTION_SLOT2_AXIS_COUNT + MOTION_SLOT3_AXIS_COUNT + \
     MOTION_SLOT4_AXIS_COUNT)

#if MOTION_SLOT_AXIS_COUNT == 0U
#error "启用运动模块时至少要启用一个本板运动槽"
#endif
#if MOTION_SLOT_AXIS_COUNT > CONFIG_MOTION_MAX_AXES
#error "已启用的本板运动槽数量不能超过 MOTION_MAX_AXES"
#endif

typedef struct {
    uint8_t port;
    uint8_t pin;
} motion_pin_t;

typedef struct {
    motion_pin_t step;
    motion_pin_t direction;
    motion_pin_t enable;
    bool direction_inverted;
    bool enable_active_low;
} motion_axis_pins_t;

static const motion_axis_pins_t motion_axis_pins[MOTION_SLOT_AXIS_COUNT] = {
#ifdef CONFIG_MOTION_SLOT0_ENABLED
    {{CONFIG_MOTION_SLOT0_STEP_PIN / 16U, CONFIG_MOTION_SLOT0_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT0_DIR_PIN / 16U, CONFIG_MOTION_SLOT0_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT0_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT0_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT0_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT0_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
    {{CONFIG_MOTION_SLOT1_STEP_PIN / 16U, CONFIG_MOTION_SLOT1_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT1_DIR_PIN / 16U, CONFIG_MOTION_SLOT1_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT1_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT1_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT1_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
    {{CONFIG_MOTION_SLOT2_STEP_PIN / 16U, CONFIG_MOTION_SLOT2_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT2_DIR_PIN / 16U, CONFIG_MOTION_SLOT2_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT2_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT2_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT2_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
    {{CONFIG_MOTION_SLOT3_STEP_PIN / 16U, CONFIG_MOTION_SLOT3_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT3_DIR_PIN / 16U, CONFIG_MOTION_SLOT3_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT3_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT3_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT3_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
    {{CONFIG_MOTION_SLOT4_STEP_PIN / 16U, CONFIG_MOTION_SLOT4_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT4_DIR_PIN / 16U, CONFIG_MOTION_SLOT4_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT4_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT4_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT4_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
};

static volatile uint32_t motion_timebase_epochs;
#endif

#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
#define WEACT_BUTTON_ENCODED_PIN 0U
#define WEACT_LED_ENCODED_PIN 18U
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
static UART_HandleTypeDef uart0_handle;
static rbsp_byte_ring_t uart0_rx_ring;
static rbsp_byte_ring_t uart0_tx_ring;
static uint8_t uart0_rx_storage[CONFIG_UART_RX_BUFFER_SIZE];
static uint8_t uart0_tx_storage[CONFIG_UART_TX_BUFFER_SIZE];
static volatile bool uart0_configured;
#endif

/*
 * 实机联调诊断计数器。它们不参与协议，也不改变运行逻辑；调试器可以在
 * 系统运行时只读查看，用于区分物理接收、远程核心响应和发送失败。
 */
volatile uint32_t rbsp_diag_can_rx_frames;
volatile uint32_t rbsp_diag_can_tx_frames;
volatile uint32_t rbsp_diag_can_tx_failures;
volatile uint32_t rbsp_diag_can_rx_failures;
#ifdef RBSP_HARDWARE_UART_ENABLED
volatile uint32_t rbsp_diag_uart_rx_bytes;
volatile uint32_t rbsp_diag_uart_tx_bytes;
volatile uint32_t rbsp_diag_uart_rx_overflows;
volatile uint32_t rbsp_diag_uart_errors;
#endif

static void put_u32(uint8_t* output, uint32_t value) {
    output[0] = (uint8_t)value;
    output[1] = (uint8_t)(value >> 8U);
    output[2] = (uint8_t)(value >> 16U);
    output[3] = (uint8_t)(value >> 24U);
}

