sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
static void receive_can_frames(void) {
    while (HAL_CAN_GetRxFifoFillLevel(&can_handle, CAN_RX_FIFO0) != 0U) {
        CAN_RxHeaderTypeDef header = {0};
        rbsp_can_frame_t frame = {0};
        if (HAL_CAN_GetRxMessage(&can_handle, CAN_RX_FIFO0, &header,
                                 frame.data) != HAL_OK) {
            ++rbsp_diag_can_rx_failures;
            return;
        }
        if (header.IDE != CAN_ID_STD || header.RTR != CAN_RTR_DATA ||
            header.DLC > 8U) {
            continue;
        }
        ++rbsp_diag_can_rx_frames;
        frame.identifier = header.StdId;
        frame.length = (uint8_t)header.DLC;
        rbsp_core_accept_can(&remote_core, &frame);
    }
}

static void make_node_info(rbsp_node_info_t* info) {
    memset(info, 0, sizeof(*info));
    put_u32(info->uuid + 0U, HAL_GetUIDw0());
    put_u32(info->uuid + 4U, HAL_GetUIDw1());
    put_u32(info->uuid + 8U, HAL_GetUIDw2());
    put_u32(info->uuid + 12U, CONFIG_BOARD_TYPE);
    info->firmware_major = CONFIG_FIRMWARE_VERSION_MAJOR;
    info->firmware_minor = CONFIG_FIRMWARE_VERSION_MINOR;
    info->firmware_patch = CONFIG_FIRMWARE_VERSION_PATCH;
    info->board_type = CONFIG_BOARD_TYPE;
}

int main(void) {
    SCB->VTOR = FLASH_BASE + CONFIG_APPLICATION_FLASH_OFFSET;
    __DSB();
    __ISB();
    HAL_Init();
    system_clock_configure();
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_AFIO_REMAP_SWJ_NOJTAG();
#if defined(CONFIG_REMOTEBSP_MOTION) || \
    defined(CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART)
    if (!motion_slot_configuration_valid()) {
        fatal_error();
    }
#endif
#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
    board_fixed_io_configure();
#endif
    startup_gpio_configure();
#ifdef CONFIG_REMOTEBSP_MOTION
    motion_outputs_configure();
    motion_timebase_configure();
#endif
    transceiver_enable();
    can_configure();
#ifdef CONFIG_USB_DEBUG_CDC
    if (rbsp_usb_debug_init()) {
        (void)rbsp_usb_debug_write_text(
            "RemoteBSP STM32F103 APP ready\r\n");
    }
#endif
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (!rbsp_byte_ring_init(&uart0_rx_ring, uart0_rx_storage,
                             sizeof(uart0_rx_storage)) ||
        !rbsp_byte_ring_init(&uart0_tx_ring, uart0_tx_storage,
                             sizeof(uart0_tx_storage))) {
        fatal_error();
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    const rbsp_soft_half_duplex_uart_hal_t soft_uart_hal = {
        .context = NULL,
        .port_prepare = soft_uart_port_prepare,
        .set_output = soft_uart_set_output,
        .set_input = soft_uart_set_input,
        .read_input = soft_uart_read_input,
        .timing_hz = CONFIG_SYSTEM_CLOCK_HZ,
        .delay_ticks = soft_uart_delay_ticks,
        .irq_save_disable = soft_uart_irq_save_disable,
        .irq_restore = soft_uart_irq_restore,
    };
    if (!rbsp_soft_half_duplex_uart_init(&soft_uart, &soft_uart_hal)) {
        fatal_error();
    }
#endif

    rbsp_node_info_t info;
    make_node_info(&info);
    const rbsp_hal_t hal = {
        .can_send = board_can_send,
        .milliseconds = HAL_GetTick,
        .gpio_configure = board_gpio_configure,
        .gpio_write = board_gpio_write,
        .gpio_read = board_gpio_read,
#ifdef RBSP_HARDWARE_UART_ENABLED
        .uart_configure = board_uart_configure,
        .uart_read = board_uart_read,
        .uart_write = board_uart_write,
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
        .uart_configure = board_soft_uart_configure,
        .uart_read = board_soft_uart_read,
        .uart_write = board_soft_uart_write,
#endif
#ifdef CONFIG_REMOTEBSP_MOTION
        .nanoseconds = board_motion_nanoseconds,
        .motion_axis_count = MOTION_SLOT_AXIS_COUNT,
        .motion_set_enable = board_motion_set_enable,
        .motion_set_direction = board_motion_set_direction,
        .motion_set_step = board_motion_set_step,
#endif
#ifdef CONFIG_APP_LAYOUT_KATAPULT_8K
        .enter_bootloader = board_enter_bootloader,
#endif
    };
    if (!rbsp_core_init(&remote_core, &hal, RBSP_CAN_CLASSICAL,
                        &info)) {
        fatal_error();
    }
#ifdef CONFIG_REMOTEBSP_MOTION
    motion_tick_timer_start();
#endif

    for (;;) {
        receive_can_frames();
        rbsp_core_poll(&remote_core);
#ifdef CONFIG_USB_DEBUG_CDC
        rbsp_usb_debug_poll();
#endif
    }
}

void SysTick_Handler(void) {
    HAL_IncTick();
}

#ifdef CONFIG_REMOTEBSP_MOTION
void TIM2_IRQHandler(void) {
    if ((TIM2->SR & TIM_SR_UIF) != 0U) {
        TIM2->SR &= ~TIM_SR_UIF;
        ++motion_timebase_epochs;
    }
}

void TIM3_IRQHandler(void) {
    if ((TIM3->SR & TIM_SR_UIF) != 0U) {
        TIM3->SR &= ~TIM_SR_UIF;
        if (remote_core.motion.state == RBSP_MOTION_ARMED ||
            remote_core.motion.state == RBSP_MOTION_RUNNING) {
            (void)rbsp_core_motion_tick(&remote_core);
        }
    }
}
#endif

#ifdef CONFIG_USB_DEBUG_CDC
void USB_LP_CAN1_RX0_IRQHandler(void) {
    rbsp_usb_debug_irq_handler();
}

void USB_HP_CAN1_TX_IRQHandler(void) {
    rbsp_usb_debug_irq_handler();
}
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
void USART1_IRQHandler(void) {
    if (!uart0_configured) {
        return;
    }

    const uint32_t status = uart0_handle.Instance->SR;
    const uint32_t receive_flags =
        USART_SR_RXNE | USART_SR_ORE | USART_SR_NE |
        USART_SR_FE | USART_SR_PE;
    if ((status & receive_flags) != 0U) {
        /*
         * F1 通过依次读取 SR 和 DR 清除 RXNE 及接收错误标志。
         * 即使同时出现 ORE，只要 RXNE 有效仍保留当前 DR 字节。
         */
        const uint8_t value = (uint8_t)uart0_handle.Instance->DR;
        if ((status & USART_SR_RXNE) != 0U) {
            if (rbsp_byte_ring_push(&uart0_rx_ring, value)) {
                ++rbsp_diag_uart_rx_bytes;
            } else {
                ++rbsp_diag_uart_rx_overflows;
            }
        }
        if ((status & (USART_SR_ORE | USART_SR_NE |
                       USART_SR_FE | USART_SR_PE)) != 0U) {
            ++rbsp_diag_uart_errors;
        }
    }

    if ((uart0_handle.Instance->SR & USART_SR_TXE) != 0U &&
        (uart0_handle.Instance->CR1 & USART_CR1_TXEIE) != 0U) {
        uint8_t value;
        if (rbsp_byte_ring_pop(&uart0_tx_ring, &value)) {
            uart0_handle.Instance->DR = value;
            ++rbsp_diag_uart_tx_bytes;
        } else {
            __HAL_UART_DISABLE_IT(&uart0_handle, UART_IT_TXE);
        }
    }
}
#endif
